note/2018/prettify-google-docs/index.org
#+SETUPFILE: ../../setup.org
#+TITLE: Prettify Google Docs
#+DATE: <2018-12-05 Wed 15:20>

If you use Google Docs heavily, it is worth it to configure a nice (and simple) set of defaults that makes the document looks nice.

* Fonts

Use EB Garamond for body text, and Montserrat for headings 1 to 6.

* Line spacing
Use 1.15.

* Page margins
Go to File — Page setup, change left and right margins to 2 inches and set to default. You can also use 1 inch margins and use two columns: go to Format — Columns and set to double columns. The point is to reduce the line length.
