note/2018/prettify-google-docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-04 Tue 00:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prettify Google Docs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yuan Fu" />
<link rel="stylesheet" type="text/css" href="../../style.css"/>
<link rel="icon" type="image/png" href="../../../favicon.png">
</head>
<body>
<div id="org-div-home-and-up-index-page">
<div>
<a accesskey="h" href="../../index.html"> UP </a> |
<a accesskey="H" href="../../index.html"> HOME </a>
</div>
<div>
<a href="../rss.xml"> RSS </a> |
<a href="https://github.com/casouri/casouri.github.io"> Source </a> |
<a href="https://creativecommons.org/licenses/by-sa/4.0/"> License </a>
</div>
</div><div id="content">
<h1 class="title">Prettify Google Docs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0533963">1. Fonts</a></li>
<li><a href="#org10dbb54">2. Line spacing</a></li>
<li><a href="#orga571a13">3. Page margins</a></li>
</ul>
</div>
</div>
<p>
If you use Google Docs heavily, it is worth it to configure a nice (and simple) set of defaults that makes the document looks nice.
</p>

<div id="outline-container-org0533963" class="outline-2">
<h2 id="org0533963"><span class="section-number-2">1</span> Fonts</h2>
<div class="outline-text-2" id="text-1">
<p>
Use EB Garamond for body text, and Montserrat for headings 1 to 6.
</p>
</div>
</div>

<div id="outline-container-org10dbb54" class="outline-2">
<h2 id="org10dbb54"><span class="section-number-2">2</span> Line spacing</h2>
<div class="outline-text-2" id="text-2">
<p>
Use 1.15.
</p>
</div>
</div>

<div id="outline-container-orga571a13" class="outline-2">
<h2 id="orga571a13"><span class="section-number-2">3</span> Page margins</h2>
<div class="outline-text-2" id="text-3">
<p>
Go to File — Page setup, change left and right margins to 2 inches and set to default. You can also use 1 inch margins and use two columns: go to Format — Columns and set to double columns. The point is to reduce the line length.
</p>

<p>
That's all.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Written by Yuan Fu <<a href="mailto:casouri@gmail.com">casouri@gmail.com</a>></p>
<p class="first-publish">First Published on 2018-12-05 Wed 15:20</p>
<p class-"last-modified">Last modified on 2020-02-03 Mon 22:58</p>
</div>
</body>
</html>
